In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [28]:
a = [0,1,2,3,4,5,6,7,8,9,10]
print(a, np.quantile(a,.25))

a.reverse()

print(a, np.quantile(a,.25))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10] 2.5
[10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0] 2.5

In [31]:
b = np.repeat(np.arange(5), 5)
b

array([0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4,
       4, 4, 4])

In [38]:
b = np.tile(np.arange(4), 4)
b
print(b, np.quantile(b,.25))

[0 1 2 3 0 1 2 3 0 1 2 3 0 1 2 3] 0.75

In [48]:
import os

print(os.getcwd())
df = pd.read_csv("data/Dateset_ODI.csv")
df.head()

/Users/neha/Development/git/MIT-DS/code/Foundations for Data Science -Week1

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [49]:
df.shape

(3932, 7)

In [50]:
df.tail()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
3927,ODI # 3928,India,New Zealand,New Zealand,6 wickets,Mumbai,"Oct 22, 2017"
3928,ODI # 3929,South Africa,Bangladesh,South Africa,200 runs,East London,"Oct 22, 2017"
3929,ODI # 3930,Pakistan,Sri Lanka,Pakistan,9 wickets,Sharjah,"Oct 23, 2017"
3930,ODI # 3931,India,New Zealand,India,6 wickets,Pune,"Oct 25, 2017"
3931,ODI # 3932,India,New Zealand,India,6 runs,Kanpur,"Oct 29, 2017"

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3932 entries, 0 to 3931
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Scorecard   3932 non-null   object
 1   Team 1      3932 non-null   object
 2   Team 2      3932 non-null   object
 3   Winner      3932 non-null   object
 4   Margin      3753 non-null   object
 5   Ground      3932 non-null   object
 6   Match Date  3932 non-null   object
dtypes: object(7)
memory usage: 215.2+ KB

In [53]:
df.describe().T

           count unique          top freq
Scorecard   3932   3932      ODI # 1    1
Team 1      3932     24    Australia  583
Team 2      3932     25    Sri Lanka  508
Winner      3932     25    Australia  555
Margin      3753    227    6 wickets  347
Ground      3932    173      Sharjah  228
Match Date  3932   3386  Feb 4, 2007    6

In [79]:
team1 = pd.DataFrame(df['Team 1'].value_counts())
team2 = pd.DataFrame(df['Team 2'].value_counts())

# print(team1, team2)

all_teams = pd.concat([team1, team2], axis=1)

all_teams.replace(np.nan, 0, inplace=True)
all_teams['total_games'] = all_teams['Team 1'] + all_teams['Team 2']
print(all_teams.count())

Team 1         26
Team 2         26
total_games    26
dtype: int64

In [83]:
pd.DataFrame(df['Ground'].value_counts())

            Ground
Sharjah        228
Dhaka          156
Sydney         154
Melbourne      147
Harare         136
...            ...
Hove             1
Nairobi          1
Vijayawada       1
Kwekwe           1
Lucknow          1

[173 rows x 1 columns]

In [86]:
a = np.array([1, 10, 2, 0])
np.power(a, 2)

array([  1, 100,   4,   0])

In [87]:
df[df['Scorecard'] == 'ODI # 50']

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
49,ODI # 50,England,Pakistan,England,132 runs,Manchester,"May 24-25, 1978"

In [90]:
df[df['Ground'] == 'Devonport']

     Scorecard   Team 1       Team 2   Winner   Margin     Ground   Match Date
429  ODI # 430  England  West Indies  England  29 runs  Devonport  Feb 3, 1987

In [91]:
df[df['Team 2'] == df['Winner']]

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
8,ODI # 9,England,West Indies,West Indies,8 wickets,The Oval,"Sep 7, 1973"
9,ODI # 10,New Zealand,Australia,Australia,7 wickets,Dunedin,"Mar 30, 1974"
10,ODI # 11,New Zealand,Australia,Australia,31 runs,Christchurch,"Mar 31, 1974"
13,ODI # 14,England,Pakistan,Pakistan,7 wickets,Nottingham,"Aug 31, 1974"
...,...,...,...,...,...,...,...
3907,ODI # 3908,Sri Lanka,India,India,168 runs,Colombo (RPS),"Aug 31, 2017"
3908,ODI # 3909,Sri Lanka,India,India,6 wickets,Colombo (RPS),"Sep 3, 2017"
3916,ODI # 3917,India,Australia,Australia,21 runs,Bengaluru,"Sep 28, 2017"
3919,ODI # 3920,P.N.G.,Scotland,Scotland,101 runs,Port Moresby,"Oct 6, 2017"
3927,ODI # 3928,India,New Zealand,New Zealand,6 wickets,Mumbai,"Oct 22, 2017"

In [ ]:
book